## Plan Result (prod)




<pre><code>Plan: 10 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.ipam.azurerm_private_dns_a_record.this[&#34;app&#34;]
  * module.ipam.azurerm_private_dns_zone.zone[0]
  * module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-aad-domain-services-mgmt-vnet&#34;]
  * module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod&#34;]
  * module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod2&#34;]
  * module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-prod-internal&#34;]
  * module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;hmi-sharedinfra-vnet-prod&#34;]
  * module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;vpn&#34;]
* Update
  * module.hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/hmcts.net/virtualNetworkLinks/core-infra-vnet-mgmt"
        name                  = "core-infra-vnet-mgmt"
      ~ tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.ipam.azurerm_private_dns_a_record.this["app"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "app"
      + records             = [
          + "10.147.79.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ipam.hmcts.net"
    }

  # module.ipam.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "ipam.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
    }

  # module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-prod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-prod-vnet"
      + private_dns_zone_name = "ipam.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet"
    }

  # module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-aad-domain-services-mgmt-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-aad-domain-services-mgmt-vnet"
      + private_dns_zone_name = "ipam.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/core-aad-domain-services-mgmt-rg/providers/Microsoft.Network/virtualNetworks/core-aad-domain-services-mgmt-vnet"
    }

  # module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-prod"
      + private_dns_zone_name = "ipam.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-idam-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-prod"
    }

  # module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-prod2"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-prod2"
      + private_dns_zone_name = "ipam.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-idam-prod2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-prod2"
    }

  # module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "ipam.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-prod-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-prod-internal"
      + private_dns_zone_name = "ipam.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod"
    }

  # module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link["hmi-sharedinfra-vnet-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "hmi-sharedinfra-vnet-prod"
      + private_dns_zone_name = "ipam.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-prod-rg/providers/Microsoft.Network/virtualNetworks/hmi-sharedinfra-vnet-prod"
    }

  # module.ipam.azurerm_private_dns_zone_virtual_network_link.vnet_link["vpn"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "vpn"
      + private_dns_zone_name = "ipam.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/mgmt-vpn-2-mgmt/providers/Microsoft.Network/virtualNetworks/mgmt-vpn-2-vnet"
    }

Plan: 10 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":775,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->